{
  "doc_id": "1VaafY8t47hjpoW6tdezGsPwLwxxaAaGc",
  "title": "1. SwaggerHub Link",
  "version": "1.2.0",
  "source_url": "https://www.google.com/url?q=https://docs.google.com/document/d/1VaafY8t47hjpoW6tdezGsPwLwxxaAaGc/edit&sa=D&source=editors&ust=1751893752660011&usg=AOvVaw1EMnmNytlmEUzqPQ_X8NAV",
  "main_content": "Revision History\nVersionDateChanges0.203-Aug-2023Updated rateable objects as per core protocol specifications and defined mapping with respect to various domainsRating flows updated0.127-Jan-2023Created - API contractto capture the ratings of a Provider or a Fulfillment\nVersion\nDate\nChanges\n0.2\n03-Aug-2023\nUpdated rateable objects as per core protocol specifications and defined mapping with respect to various domains\nRating flows updated\n0.1\n27-Jan-2023\nCreated - API contractto capture the ratings of a Provider or a Fulfillment\n1. SwaggerHub Link\nTBU\n2. Overview\nONDC takes a very different approach to eCommerce as compared to the platform-based models observed so far. ONDC is developing a network todemocratizecommerce by building an open, interoperable network on which buyers and sellers can transact without needing to be present on the same platform. The foundation of the network are open standards for interoperability and unbundling of the e-commerce value chain. This also involves a large component of building trust in the various entities involved.  The starting point of any transaction would be a search for a product / service.\nAtthe point of time of search,the buyer would want to know the rating / score of the seller / product responding to the request. Typically, a rating system allows a customer to provide a rating value between a certain range illustratively from 1 to 5 where 1 represents lowest quality of serviceor a productand 5 represents the highest quality of service or a product. The ratings capturedmaybe discrete integral ratings, fractional ratings for further granularity, and non-numeric values such as \"Good\" or \"Bad''. The rating system is expected to be fair and transparent to its users, both customers and product/ service providers. The rating value of a particular product or service or service provideris typically made visible to all users.\nOpen Network for Digital Commerce (ONDC) is an initiative aimed at promoting open networks for all aspects of the exchange of goods and services over a digital network. Interoperability allows different platforms to communicate with each other easily while unbundling allows the ONDC network to have multiple different types of Network Participants, each handling specific aspects of the e-commerce value chain. Participants such as buyer apps are responsible for customer acquisition, search and discovery, and curating the customer experience while seller Apps are responsible for onboarding sellers, managing theircatalogsand managing order flow.\nIn such a context, the Buyer Application / Buyer would want to know not just the specifics of the product / service that they may want to procure - but also the associated score. Similarly, the Seller Application / Seller may also want to know the score / rating of the Buyer Application / Buyer to decide either to respond to the request and/ or to possibly change the terms and conditions associated with the search request received from the Buyer Application.\nThe ONDC Network Rating framework is an attempt to resolve various issues at play. ONDC will enable the collection & collation of the various ratings and reviews from a Buyer and then transmit them to the Seller Application(s). Buyer Application will collect, collate and send the rawratingsand Seller Application will store the rawratings.Anaggregated score, as calculated by the Network Score Ledgershallbe transmitted to whoever wants to consume the data (e.g. reporting agencies, scoringagencies, badging agenciesetc.).Seller Applications will also send out the scores to the Buyer Applications as and when they receive a search requestas part of the product/ service catalog shared by the Seller Application.\nThe long term implementation vision for ONDC Scores andBadgesis toutilizethe telemetry data associated with a search through to orderfulfillmentfor a particular order to createScores. Using the scores, various entities can add additional factors (such as tax filing compliances, GSTIN information) and createBadges. Aggregated and anonymized datamaybe shared with theagencies to create badges. The Scores and Badges will be network-wide and portable. That means, if a seller wants to migrate from their current Seller App to another one, they can make that switch without losing all the goodwill and reputation they may have generated overthe network.\nThe next section details the planned phased implementation of ONDC Rating,Scores and Badges.\n3. Phased Implementation of ONDC Scores and Badges\nPhase 1:Rating\nThe first phase of ONDC Scores and Badges comprises the development of rating capabilities for capturing and traversing ratings for on-network transactions. This Rating API contract has been developed belowtodefine the specifications in which rating must be captured and transmitted overthe network.\nPhase 2: Scores\nThe second phase comprises implementation of the Network Score Ledger. The captured ratings shall be leveraged to calculate scores ofuniqueentities (sellers and logistics service providers) on the network. ANetwork Score Ledger shall be implemented[a]in order to securely captureandretain entity scoresand be referenced for dissemination of such scores. The ratings capturedtillsuch time the score ledger is implemented shall be migrated to the ledger for calculation of scores. The score may be eitherbase(which is a simple average of the ratings captured) or it may be aderivedscore involving other aspects of a digital commerce value chain such as issues, disputes andcanceledorders to name a few.\nPhase 3: Badges\nThe third phase comprises implementation of Network Badges. Badging Entities, functioning in a manner similar tobureaus, shall be providing ‘Badges’ to network participants through their badging frameworks leveraging the calculated network scores (implicit or derived). Network participants shall be able to access and showcase their badges for other network participants or end users providing them an indicator of thetrustworthiness and the track record with respect to the quality of service of the participant. These badgesmay be implementedsimilar to verifiable credentials or certificates that a network participant can showcase on the network for end users and other network participants.\n4. Role of participants in a transaction\nThe table below lists the different participants that will be involved in a network rating capture process. Every participant listed below in the process may not be a ONDC network participant.\nEntityDescriptionConsumerConsumerorbuyeris the actor that is making a purchase for a good/ service on ONDC NetworkBuyer AppBuyer App enables the transaction on the buyer’s endSeller AppSeller App enables the transaction on the seller’s endLSPLogistic Service Provider (LSP) enables the fulfillment of the order if logistics have been procured on-networkRateable objectAn object that can be ratedRating providerThe rating provider is an actor that is providing the rating, e.g. BuyerRating requestorThe entity that is requesting rating on their rateable objects, e.g SellerRating collectorThe entity (e.g. Buyer App) that collects the ratings on the rateable objects shared to them by the rating requestor. The rating collector's responsibility is to transmit the captured rating to the rating requestor.\nEntity\nDescription\nConsumer\nConsumerorbuyeris the actor that is making a purchase for a good/ service on ONDC Network\nBuyer App\nBuyer App enables the transaction on the buyer’s end\nSeller App\nSeller App enables the transaction on the seller’s end\nLSP\nLogistic Service Provider (LSP) enables the fulfillment of the order if logistics have been procured on-network\nRateable object\nAn object that can be rated\nRating provider\nThe rating provider is an actor that is providing the rating, e.g. Buyer\nRating requestor\nThe entity that is requesting rating on their rateable objects, e.g Seller\nRating collector\nThe entity (e.g. Buyer App) that collects the ratings on the rateable objects shared to them by the rating requestor. The rating collector's responsibility is to transmit the captured rating to the rating requestor.\n5. Key Principles\nRatings will be only for transactions that havesuccessfully executedon the ONDC network\nThefinal rating/ scoreshall be calculated on the basis of rating(s) given from 1 to 5 for individual transactions\nAtransactionmayhave up tofiveratings\nOne for the order or the overall experience\nSecondfor theseller/ provider\nThird for the product(s)/ service(s)\nFourthfor thefulfillmentas provided by thelogistics service provider (LSP)\nFifth for the agent fulfilling the order/ fulfillment\nSimple API driven model to be adopted for capturing ratings over the network\nA rating window shall be defined for capturing ratings from the consumer\nThe window will be from the time a product/ service is delivered/ fulfilled till 7 days after the return window has expired\nOnce a consumer provides a rating for a rateable object, it can be updated only once within a time periodT+1 day[b][c], where T signifies the time when the rating was provided\nIf the rating is provided on the last day of the rating window expiry, the consumer has up to the end of the day to update the rating\nFraudulent ratings are to be managed by thebuyerapplication which is capturing the ratings[d]\n6. ONDC Network Rating\nRateable Objects\nThe rating requesters shall be providing their rateable objects on request to the rating collector. The rateable objects in the implementation of Network Rating shall be among the following objects as defined in the Core Protocol Specification:\nOrder - referring to a legal purchase order containing the complete details of the legal contract created between the buyer and the seller for the purchase of a product/ service\nProvider - referring to the provider from which the customer wants to place to the order from\nItem - item (product/ service) that the consumer wants to order\nFulfillment - referring to how the consumer wants their order fulfilled\nAgent - referring to the direct performer, driver or executor that fulfills an order\nThe rating may be captured for all the above rateable objects as provided by the consumer. The ledger shall be capturing ratings for de-duplicatable entities (i.e. sellers or seller_on_record) only to begin with. As the rating/ score implementation matures, more objects may be added to be captured in the ledger.\nRating provided for the ‘order’ object shall mean that the rating provided by the consumer for the overall experience of respective orders being placed over the network.\nRating provided for the ‘provider’ object shall mean that the rating provided by the consumer for the experience of the product/service-seller combination is captured for the seller/ provider. This will be aggregated for a uniqueentityand would act as the base score for the provider/ seller-on-record.\nRating provided for the ‘item’ object shall mean that the rating provided by the consumer for the product/ service is captured by the seller app.\nRating provided for the ‘fulfillment’ object(s) shall mean that the rating provided by the consumer for the fulfillment’s experience is captured for the fulfillment service provider respective to the fulfillment(s). In case there are multiple fulfilments provided by a fulfillment seller in an order, ratings for all fulfilments shall be applicable for that logistics seller. This will be aggregated for a unique entity and would act as the base score for the logistics provider/ seller-on-record for retail transactions.\nWith ONDC enabling multiple domains with different flows and use cases, the rateable objects applicable shall be specific to respective domains as illustrated below:\nRateable objectRetailMobilityFinancial Services…OrderApplicableApplicableApplicable…ProviderApplicableApplicableApplicable…ItemApplicableApplicableApplicable…FulfillmentApplicableApplicableNot Applicable…AgentApplicableApplicableNot Applicable…\nRateable object\nRetail\nMobility\nFinancial Services\n…\nOrder\nApplicable\nApplicable\nApplicable\n…\nProvider\nApplicable\nApplicable\nApplicable\n…\nItem\nApplicable\nApplicable\nApplicable\n…\nFulfillment\nApplicable\nApplicable\nNot Applicable\n…\nAgent\nApplicable\nApplicable\nNot Applicable\n…\nNetwork Rating Capture Process Flow\nThe network rating process flow has been divided into two parts as defined in the following sections.\nRating journey illustration in Retail domain\nAn order was placed by a buyer on a buyer app interface for product provided by a seller through a seller app fulfilled by an on-network logistics services provider\nConsumer - the buyer of the product who provides ratings on the buyer app\nBuyer app - the buyer app captures ratings for the rateable objects\nSeller app - the seller app where the seller is enlisted. It receives the ratings captured from the buyer app\nSeller - the seller will be rated as per the provider rateable object\nProduct - the product will be rated as per the item rateable object\nFulfillment seller app - the logistics\nFulfillment provider - the logistics service provider fulfilling the product delivery is being rated as per the fulfillment object\nAgent - the logistics provider’s agent who is fulfilling the delivery is being rated as per the agent object\na.Rateableobjects forseeking ratings\nThe buyer app has to seek ratings from the consumer for all the five rateable objects. Out of these ratings, the ratings for theprovider object and the fulfillment object[e][f]shall be pushed to the ONDC Network Score Ledger by the rating requestor.\nThe question to be rendered by the buyer app for the consumer to provide ratings shall be as follows:\nOrder object - “Rate your overall experience”\nProvider object - “Rate the seller”\nItem object - “Rate the product/ service”\nFulfillment object - “Rate the delivery experience”[g][h]\nAgent object - “Rate the delivery agent”\nb. Consumer provides ratings for the rateable objects\nOnce the order is completed/ fulfilled, the buyer app will be rendering the rating request to the consumer for the consumer to rate:\nThe buyer app enables the rating button/link post order fulfillment.\nThe consumer provides ratings for the rateable objects rendered by the buyer app, at their discretion (may be for selective objects or for all)\nConsumers mayprovide ratings up to 7 days post expiry of return window[i], referred as rating window\nOnce a consumer provides a rating for a rateable object, it can be updated only once within a time period T+1 day, where T signifies the time when the rating was provided\nIf the rating is provided on the last day rating window expiry, the consumer has up to the end of the day to update the rating\nBuyer app sends the rating(s) captured for every rateable object to the seller app\nThe seller app sends the ratings captured for the provider as-is to the ledger using the APIs as defined in the scoring framework\nIf the rateable object on which rating is received is of the LSP (or further cascaded apps), seller apphas tosend the respective rating(s) received to the LSP\nThe rating(s) received may be cascaded to further rating requestors as required\nThe LSP sends the ratings captured for the fulfillment as-is to the ledger using the APIs as defined in the scoring framework\nLSP (or further cascaded apps) respond to the seller app with their feedback URL/ form for their respective rateable objects for taking feedbacks on the rating received\nSeller app responds to the buyer app with their feedback URL for respective rateable object for taking feedbacks on the rating received\nIf the rateable object was provided by the LSP (or further cascaded apps), seller apphas toshare the feedback URL received from the LSP (or further cascaded apps)\nBuyer app must render the feedback URL of the rateable object received to the buyer for collecting respective feedback.\nThese URLs will be managed by respective application (i.e. Seller App, Logistics service provider)\n7. Technical details for Network Rating\nSequence Diagram\nScenario1:Buyer providing rating for the Retail Seller App[j][k]\n[l][m][n]\n[o][p][q]\nScenario 2: Buyer providing rating for theLogistics Seller App[r][s]\nRating APIs Schema[t][u]\n/rating\n{\n\"context\":\n{\n\"domain\": \"string\",\n\"country\": \"IND\",\n\"city\": \"*\",\n\"action\": \"rating\",\n\"core_version\": \"1.2.0\",\n\"bap_id\": \"string\",\n\"bap_uri\": \"string\",\n\"bpp_id\": \"string\",\n\"bpp_uri\": \"string\",\n\"transaction_id\": \"string\",\n\"message_id\": \"string\",\n\"timestamp\": \"2023-01-10T04:12:24.524Z\",\n\"ttl\": \"string”\n},\n\"message\":\n{\n\"order_id\": \"string\",\n\"ratings\":\n[\n{\n\"rating_category\": \"string\",\n\"id[v][w]\": \"string\",\n\"value\": \"string\"\n}\n]\n}\n}\n/on_rating\n{\n\"context\":\n{\n\"domain\": \"string\",\n\"country\": \"IND\",\n\"city\": \"*\",\n\"action\": \"on_rating\",\n\"core_version\": \"1.2.0\",\n\"bap_id\": \"string\",\n\"bap_uri\": \"string\",\n\"bpp_id\": \"string\",\n\"bpp_uri\": \"string\",\n\"transaction_id\": \"string\",\n\"message_id\": \"string\",\n\"timestamp\": \"2023-01-10T04:15:20.452Z\",\n\"ttl\": \"string\"\n},\n\"message\":\n{\n\"feedback_form\":\n{\n\"form\":\n{\n\"url\": \"string\",\n\"data\": \"string\",\n\"mime_type\": \"text/html\"\n}\n}\n}\n}\nRating flow\nScenario 1: Buyer providing rating for the seller and item\nStep 1 - Buyer app sharing rating to the seller app for provider object\n/rating\n{\n\"context\":\n{\n\"domain\": \"ONDC:RET10\",\n\"action\": \"rating\",\n\"core_version\": \"1.2.0\",\n\"bap_id\": \"ondc.abcbuyer.com\",\n\"bap_uri\": \"https://ondc.abcbuyer.com/buyer\",\n\"bpp_id\": \"ondc.xyzseller.com\",\n\"bpp_uri\": \"https://ondc.xyzseller.com/seller\",\n\"transaction_id\": \"ff7c42fe-7071-11ed-a1eb-0242ac120000\",\n\"message_id\": \"15010131619222530\",\n\"city\": \"*\",\n\"country\": \"IND\",\n\"timestamp\": \"2023-01-01T02:00:00.120Z\"\n},\n\"message\":\n{\n\"order_id\": \"O1\",\n\"ratings\":\n[\n{\n\"rating_category\": \"order\",\n\"id\": \"ORD1-18275-ONDC-1\",\n\"value\": \"4\"\n},\n{\n\"rating_category\": \"provider\",\n\"id\": \"18275-ONDC-1\",\n\"value\": \"4\"\n},\n{\n\"rating_category\": \"item\",\n\"id\": \"18275-ONDC-1-10001\",\n\"value\": \"5\"\n},\n{\n\"rating_category\": \"item\",\n\"id\": \"18275-ONDC-1-10002\",\n\"value\": \"3\"\n},\n{\n\"rating_category\": \"agent\",\n\"id\": \"18275-ONDC-1-10001[1]\",\n\"value\": \"5\"\n},\n{\n\"rating_category\": \"fulfillment\",\n\"id\": \"18275-ONDC-1-10001\",\n\"value\": \"4\"\n}\n]\n}\n}\nStep 2 - Seller app sharing their feedback url/ form to be shared with the buyer\n/on_rating\n{\n\"context\":\n{\n\"domain\": \"ONDC:RET10\",\n\"action\": \"on_rating\",\n\"core_version\": \"1.2.0\",\n\"bap_id\": \"ondc.abcbuyer.com\",\n\"bap_uri\": \"https://ondc.abcbuyer.com/buyer\",\n\"bpp_id\": \"ondc.xyzseller.com\",\n\"bpp_uri\": \"https://ondc.xyzseller.com/seller\",\n\"transaction_id\": \"ff7c42fe-7071-11ed-a1eb-0242ac120000\",\n\"message_id\": \"15010131619222530\",\n\"city\": \"*\",\n\"country\": \"IND\",\n\"timestamp\": \"2023-01-01T02:05:05.010Z\"\n},\n\"message\":\n{\n\"feedback_form\":\n{\n\"form\":\n{\n\"url\": \"www.sellerapp.com/ratingcapture\",\n\"mime_type\": \"text/html\"\n}\n}\n}\n}\nScenario 2: Buyer providing rating for the Logistics App\nStep 1 - Buyer app sharing rating to the seller app for fulfillment and agent\n/rating\n{\n\"context\":\n{\n\"domain\": \"ONDC:RET10\",\n\"action\": \"rating\",\n\"core_version\": \"1.2.0\",\n\"bap_id\": \"ondc.abcbuyer.com\",\n\"bap_uri\": \"https://ondc.abcbuyer.com/buyer\",\n\"bpp_id\": \"ondc.xyzseller.com\",\n\"bpp_uri\": \"https://ondc.xyzseller.com/seller\",\n\"transaction_id\": \"ff7c42fe-7071-11ed-a1eb-0242ac120000\",\n\"message_id\": \"15010131619222530\",\n\"city\": \"*\",\n\"country\": \"IND\",\n\"timestamp\": \"2023-01-01T02:00:00.120Z\"\n},\n\"message\":\n{\n\"order_id\": \"O1\",\n\"ratings\":\n[\n{\n\"rating_category\": \"item\",\n\"id\": \"Item1\",\n\"value\": \"5\"\n},\n{\n\"rating_category\": \"fulfillment\",\n\"id\": \"Fulfillment1\",\n\"value\": \"4\"\n},\n{\n\"rating_category\": \"agent\",\n\"id\": \"Agent1\",\n\"value\": \"3\"\n}\n]\n}\n}\nStep 2 - Seller app sharing rating to the logistics provider app for fulfillment and agent\n/rating\n{\n\"context\":\n{\n\"domain\": \"nic2004:60232\",\n\"action\": \"rating\",\n\"core_version\": \"1.2.0\",\n\"bap_id\": \"ondc.xyzseller.com\",\n\"bap_uri\": \"https://ondc.xyzseller.com/seller\",\n\"bpp_id\": \"ondc.lmnoseller.com\",\n\"bpp_uri\": \"https://ondc.lmnoseller.com/lsp\",\n\"transaction_id\": \"gg8c42fe-7071-11ed-a1eb-0242ac130001\",\n\"message_id\": \"75000031619222541\",\n\"city\": \"*\",\n\"country\": \"IND\",\n\"timestamp\": \"2023-01-01T02:00:00.120Z\"\n},\n\"message\":\n{\n\"order_id\": \"O1\",\n\"ratings\":\n[\n{\n\"rating_category\": \"fulfillment\",\n\"id\": \"Fulfillment1\",\n\"value\": \"4\"\n},\n{\n\"rating_category\": \"agent\",\n\"id\": \"Agent1\",\n\"value\": \"3\"\n}\n]\n}\n}\nStep 3 - Logistics provider app sharing their feedback url/ form to be shared with the buyer\n/on_rating\n{\n\"context\":\n{\n\"domain\": \"nic2004:60232\",\n\"action\": \"on_rating\",\n\"core_version\": \"1.2.0\",\n\"bap_id\": \"ondc.xyzseller.com\",\n\"bap_uri\": \"https://ondc.xyzseller.com/seller\",\n\"bpp_id\": \"ondc.lmnoseller.com\",\n\"bpp_uri\": \"https://ondc.lmnoseller.com/lsp\",\n\"transaction_id\": \"gg8c42fe-7071-11ed-a1eb-0242ac130001\",\n\"message_id\": \"75000031619222541\",\n\"city\": \"*\",\n\"country\": \"IND\",\n\"timestamp\": \"2023-01-01T02:05:05.010Z\"\n},\n\"message\":\n{\n\"feedback_form\":\n{\n\"form\":\n{\n\"url\": \"www.logisticsapp.com/ratingcapture\",\n\"mime_type\": \"text/html\"\n}\n}\n}\n}\nStep 4 - Seller app sharing logistics provider app’s feedback url/ form to be shared with the buyer\n/on_rating\n{\n\"context\":\n{\n\"domain\": \"ONDC:RET10\",\n\"action\": \"on_rating\",\n\"core_version\": \"1.2.0\",\n\"bap_id\": \"ondc.abcbuyer.com\",\n\"bap_uri\": \"https://ondc.abcbuyer.com/buyer\",\n\"bpp_id\": \"ondc.xyzseller.com\",\n\"bpp_uri\": \"https://ondc.xyzseller.com/seller\",\n\"transaction_id\": \"ff7c42fe-7071-11ed-a1eb-0242ac120000\",\n\"message_id\": \"15010131619222530\",\n\"city\": \"*\",\n\"country\": \"IND\",\n\"timestamp\": \"2023-01-01T02:00:00.120Z\"\n},\n\"message\":\n{\n\"feedback_form\":\n{\n\"form\":\n{\n\"url\": \"www.logisticsapp.com/ratingcapture\",\n\"mime_type\": \"text/html\"\n}\n}\n}\n}\n[1]Fulfilment id\n[a]Will this ledger be implemented centrally ?\n[b]As suggested, we have kept T+1 as the time period for the rating to be updated by the buyer.\nIt may be extended to be open till 7th day of the return window completion.\n@rahul@ondc.org @ramu@ondc.org\n[c]The discussion was to have this editable for an extended period of time, as is currently done on platforms. is there a change in understanding on this?\n@rishabhnand.singh@ondc.org @neeraj@ondc.org\n[d]What constitutes a fraudulent rating?\n[e]Means ,\n1. Provider / Seller-on-Record\n2. Fulfillment - Only ISNs\nie. Shadowfax ( in case of ISN )   will be rated as they are the only fulfillment/service provider.\nOnly these 2 entities rating will be stored in ledger in the first phase .\n[f]Correct. Ratings will be captured for providers only.\n[g]In case of multiple items from Multiple providers / fulfilments .. we will be capturing the ratings for all .\nIn such scenario where will the Order object rating will be used for/to\n[h]A transaction (single payment for a buyer) may have multiple network orders respective to various sellers in the \"cart\" and each order would then have subsequent items and fulfillments.\nOrder object being rated will not be mapped to any entity/ aspect of the transaction/ order.\n@ramu@ondc.org How should this be handled?\n[i]depending on category, there can be cases where user provides ratings even 1-2 months after purchase. We can avoid limiting the period, to increase submission %age\n[j]how will the buyer be notified to provide a rating? The buyer will provide a rating based on what? Aren't we defining the questions for the buyer to ensure objectivity in rating across providers / LSPs?\n[k]The buyer will be notified post order is delivered. How the notification is literally done by the buyer app is upto their implementation.\nThe buyer app has to render the question as we have defined in the previous section.\nFor Provider Object (i.e. retail seller) - “Rate the seller”\nFor Fulfilment Object (i.e. logistics seller) - “Rate the delivery experience”\n[l]What  happens if seller app doesnot have any feedback url  and it does off network logistics .\n[m]on_rating is optional\n[n]is there a check that all ratings received by a Seller App/NP are pushed into the Rating ledger. What are the check measures to ensure there is no \"selective rating ingestion\" done by Seller NPs?\n[o]What  happens if seller app doesnot have any feedback url  and it does off network logistics .\n[p]on_rating is optional\n[q]is there a check that all ratings received by a Seller App/NP are pushed into the Rating ledger. What are the check measures to ensure there is no \"selective rating ingestion\" done by Seller NPs?\n[r]In this scenario should retail seller also maintain rating ledger ? @rishabhnand.singh@ondc.org\n[s]Yes, the ratings captured have to be stored by the retail seller app and the logistics seller app\n[t]behaviour has to be very clearly defined:\n1. when should the seller app / LSP expect a rating API call? Is it based on specific order or fulfillment state(s)? what should the seller app do if they receive this call outside these state(s)?\n2. How do they map the rating API call to an order?\n3. What should the buyer app expect as response to valid /rating:\na. ACK alone?\nb. ACK followed by /on_rating?\nc. any other options?\nwhen should they expect these response(s) & can there be multiple responses at any time? does the buyer app need to know if the rating has been processed successfully?\n[u]1. Rating call can take place after the order is marked delivered (order state - completed) up until 7 days post the return window expiry date.\nIt will not be applicable if the order state is cancelled since neither the product was delivered nor the services were rendered.\nIt will be applicable even if the product has been returned up to 7 days post the return has been processed.\nIn case the rating call is received outside the 'Completed' state, the seller will have to check the order state and provide a NACK, in case the order state is something other then 'Completed'.\nA new code may have to be defined for this scenario. For now we can start with code '30015'\n2. The ratings shall be identified using the transaction id.\n3. As a response, the buyer app should expect an Ack (Nack in case of any errors). This shall be followed by an optional on_rating.\nThere would only be one response provided by the seller. This shall contain the feedback questions that are to be rendered by the buyer app to the buyer for capturing the feedback.\nReceiving an ack becomes the confirmation for the buyer app that the rating has been successfully processed. If no response is received, similar retry mechanisms have to be employed as for other APIs.\n[v]what's this id? provider id / fulfillment id? How can the buyer provide rating for multi-seller orders when they're enabled?\n[w]This is the object id as provided in the retail API transactions.\nFor rating_category - provider, the id will be of the provider.\nFor rating_category - fulfilment, the id will be of the fulfilment\nThe buyer will provide ratings for individual sellers and fulfilments.",
  "footer_content": "",
  "enums": {},
  "definitions": {
    "shall": "that the rating provided by the consumer for the fulfillment’s experience is captured for the fulfillment service provider respective to the fulfillment(s). In case there are multiple fulfilments provided by a fulfillment seller in an order, ratings for all fulfilments shall be applicable for that logistics seller. This will be aggregated for a unique entity and would act as the base score for the logistics provider/ seller-on-record for retail transactions."
  },
  "hyperlinks": []
}