{
  "doc_id": "1iqLdayk488ekEzKrEs-yn6gVrevbxBkILBe5j4oIxMY",
  "title": "Untitled Document",
  "main_content": "Revision History\nVersionDateChanges0.918th Jan 2023Updated buyer finder fee (BFF) calculations in 4a;26th Nov 2022Changed definition of buyer app finder fee as % of total order value or fixed amount per order;Added label = “Invoice” for Order.documents0.827th Aug 2022Added transaction_id for pre-paid payment collection scenarios, removed transaction_status0.720th May 2022Response to comments & queries;0.624th Mar 2022Changed scenarios d & e for Seller App collecting payment & updating status using unsolicited callback;0.522nd Mar 2022Changed “seller app settlement details” for scenario 2 to “buyer app settlement details” (page 12);Added for scenario b - “Who collects payment” - if the Seller App asserts its right to collect payment, the buyer app should agree in the subsequent /init call (page 17);0.416th Mar 2022Assertion to collect payment (by Buyer App or Seller App) to be decided during order initialization, whether or not it’s a part of search intent;Deterministic negotiation protocol for payment & settlement terms;Withholding amount to be held by entity that collects payment;Updated Technical Specs for different scenarios;Added scenarios for settlement;0.38th Feb 2022Incorporate following changes to align with updated ONDC Commercial Policy Release 1:Willingness to collect payment will be a part of the search intent from the Buyer App;Settlement time starts from the time the proof of payment is available;Open Issues - markup for buyer app during initialising checkout of order? refund trail for COD;0.27th Feb 2022Initial version\nVersion\nDate\nChanges\n0.9\n18th Jan 2023\nUpdated buyer finder fee (BFF) calculations in 4a;\n26th Nov 2022\nChanged definition of buyer app finder fee as % of total order value or fixed amount per order;\nAdded label = “Invoice” for Order.documents\n0.8\n27th Aug 2022\nAdded transaction_id for pre-paid payment collection scenarios, removed transaction_status\n0.7\n20th May 2022\nResponse to comments & queries;\n0.6\n24th Mar 2022\nChanged scenarios d & e for Seller App collecting payment & updating status using unsolicited callback;\n0.5\n22nd Mar 2022\nChanged “seller app settlement details” for scenario 2 to “buyer app settlement details” (page 12);\nAdded for scenario b - “Who collects payment” - if the Seller App asserts its right to collect payment, the buyer app should agree in the subsequent /init call (page 17);\n0.4\n16th Mar 2022\nAssertion to collect payment (by Buyer App or Seller App) to be decided during order initialization, whether or not it’s a part of search intent;\nDeterministic negotiation protocol for payment & settlement terms;\nWithholding amount to be held by entity that collects payment;\nUpdated Technical Specs for different scenarios;\nAdded scenarios for settlement;\n0.3\n8th Feb 2022\nIncorporate following changes to align with updated ONDC Commercial Policy Release 1:\nWillingness to collect payment will be a part of the search intent from the Buyer App;\nSettlement time starts from the time the proof of payment is available;\nOpen Issues - markup for buyer app during initialising checkout of order? refund trail for COD;\n0.2\n7th Feb 2022\nInitial version\n1. Overview\nThe objective of this note is to propose a payment & settlement protocol for initiating discussion with the ONDC community. ONDC will support a diverse set of Buyer App and Seller App entities, in different domains, each of whom may have their own policies for payment collection by themselves and for settlement with the counterparty. This note proposes a way for different parties, to a transaction, to mutually negotiate their payment & settlement terms & conditions that leads to a deterministic outcome for the order transaction.\nPayment collection could be at either of these points:\nBuyer App\nSeller App\nLogistics Agent - only for Cash on Delivery (COD)\nEvery transaction in ONDC will be a bilateral transaction between a Buyer App and Seller App. Payment & Settlement, between different participating entities, will happen using existing payment technology (e.g. payment gateway, UPI, wallets, etc.) and will be outside the network. However, the terms & conditions, for such Payment & Settlement, and the promise or proof of payment will be transmitted using the underlying protocol.\nFor the 1st two collection points defined above, there are 4 possible scenarios for payment collection in ONDC:\n[a]\nFigure 1\nCollection Flexibility: Possible Scenarios\nONDC will allow collection flexibility, i.e. allow the Buyer App or Seller App to decide whether to collect payment for an order, as per their collection policies, and have it acceptable to the counterparty. This can include the following scenarios:\nBuyer App asserts its right to collect payment, optionally through the search intent but also during Order initialization. This has to be accepted by the Seller App during Order initialization, irrespective of whether they honoured the assertion during the search intent;\nBuyer App doesn’t assert its right to collect payment, optionally through the search intent but also during order initialization. This has to be accepted by the Seller App, by agreeing to collect payment, during Order initialization, irrespective of whether they honoured the lack of assertion, by the Buyer App, during the search intent by implicitly agreeing to collect payment through their display of the Catalogue;\nWhile scenarios 1 & 3 above result in agreement between the Buyer App & Seller App, regarding payment collection, scenarios 2 & 4 above result in lack of agreement and the Order transaction failure prior to confirmation. “Who collects payment” is one of the parameters that will be negotiated between the counterparties to the transaction and the other parameters are defined later in this note. In order to ensure a deterministic outcome for this type of negotiation, anegotiation[b]protocolis proposed.\nPayment & Settlement in ONDC will be guided by ONDC network policies which will evolve in consultation with the participant community. Payment & Settlement in ONDC will be guided by the following network policies:\nParticipants in the ONDC networkwill not need to enter into bilateral or multilateral agreements, with other participants, for settlement. Instead, all participants need to adhere to a Network Level Agreement with ONDC that among others will also define the payment & settlement terms, which includes payment & settlement outside the network through the mutual negotiation & transmission of these terms, alongwith the proof or promise of payment, between participants;\nWhoever collects the payment (i.e. Buyer app or Seller app) could optionally maintain a refund pool, using the withholding amount from a transaction, which could be used to settle refunds in cases of returns, damaged items, etc, and that is withheld until the return window closes;\nIt is also possible that Buyer App and Seller App mutually agree to settle for a delivered orderafter expiry of the return window. In this case, neither the Buyer App nor the Seller App shall be required to maintain a refund pool created from withholding amount and will also eliminate the need for reconciliation of withholding amount and its adjustment;\n2. Role of participants in a transaction\nThe table below lists the different participants in a transaction, covering all possible payment & settlement scenarios, and hence could be involved in the payment & settlement process. Every participant in the payment & settlement process may not be a ONDC network participant (all such participants who are also ONDC network participants are colour-coded).\nThe key participants in a transaction are:\nBuyer- orders items using Buyer App;\nBuyer App- entity that provides the Buyer Application, using which the buyer can purchase items using ONDC;\nSeller App- entity that provides the Seller Application which is a storefront for the sellers, for publishing their catalogue and processing & fulfilling orders;\nSeller-  any merchant or store that maintains items and processes & fulfils orders for these items through a Seller App;\nParticipant TypesBuyerBuyer AppSeller AppSellerLogistics Agent - only for Cash on Delivery (CoD)BuyerNA1. BuyerpaysBuyer App using their payment gateway or other online / offline mechanism. Buyer app may even provide a custom payment plan for the buyer;2. Buyer App settles with Seller App and other participants as applicable (e.g. Logistics Provider) as per their settlement terms after deducting the withholding amount (from the Seller App);3. After the return window closes, Buyer App settles the withholding amount with Seller App (in case of no refunds for return, damages, etc.);1. BuyerpaysSeller App using the payment terms transmitted as part of the protocol;2. Seller App settles with the other participants in the transaction as per their settlement terms;3. Seller App settles with Seller as per their mutual terms & conditions. Seller App can also maintain refund pool using withholding amount from the Seller to handle cases like refund for return, damages, etc.;NAScenario 1 -Logistics Services procured by Seller App:1. Buyerpaysthe Logistics agent post fulfilment of the order;2. Logistics Agent remits the collection to the Logistics  Provider as per their settlement terms;3. Logistics Provider settles with Seller App (after deducting the amount for logistics services), as per their mutual settlement terms;4. Seller App settles with Buyer App as per their mutual settlement terms;5. Seller App can also maintain refund pool using withholding amount from the Seller to handle cases like refund for return, damages, etc.;Scenario 2 -Logistics Services procured by Buyer App:1. Buyerpaysthe Logistics agent post fulfilment of the order;2. Logistics Agent remits the collection to the Logistics Provider as per their mutual settlement terms;3. Logistics Provider settles with Buyer App (after deducting the amount for logistics services), as per their mutual settlement terms;4. Buyer App settles with Seller App after deducting the withholding amount, as per their mutual settlement terms;5. After the return window closes, Buyer App settles withholding amount with the Seller App (in case of no refund for return, damages, etc.);Buyer AppNANADiscussed aboveNANASeller AppNADiscussed aboveDiscussed above (e.g. between retail seller app and logistics seller app)Seller Appsettleswith Seller as per their mutual terms & conditionsNASellerNANANANANALogistics AgentNADiscussed aboveDiscussed aboveNANA\nParticipant Types\nBuyer\nBuyer App\nSeller App\nSeller\nLogistics Agent - only for Cash on Delivery (CoD)\nBuyer\nNA\n1. BuyerpaysBuyer App using their payment gateway or other online / offline mechanism. Buyer app may even provide a custom payment plan for the buyer;\n2. Buyer App settles with Seller App and other participants as applicable (e.g. Logistics Provider) as per their settlement terms after deducting the withholding amount (from the Seller App);\n3. After the return window closes, Buyer App settles the withholding amount with Seller App (in case of no refunds for return, damages, etc.);\n1. BuyerpaysSeller App using the payment terms transmitted as part of the protocol;\n2. Seller App settles with the other participants in the transaction as per their settlement terms;\n3. Seller App settles with Seller as per their mutual terms & conditions. Seller App can also maintain refund pool using withholding amount from the Seller to handle cases like refund for return, damages, etc.;\nNA\nScenario 1 -Logistics Services procured by Seller App:\n1. Buyerpaysthe Logistics agent post fulfilment of the order;\n2. Logistics Agent remits the collection to the Logistics  Provider as per their settlement terms;\n3. Logistics Provider settles with Seller App (after deducting the amount for logistics services), as per their mutual settlement terms;\n4. Seller App settles with Buyer App as per their mutual settlement terms;\n5. Seller App can also maintain refund pool using withholding amount from the Seller to handle cases like refund for return, damages, etc.;\nScenario 2 -Logistics Services procured by Buyer App:\n1. Buyerpaysthe Logistics agent post fulfilment of the order;\n2. Logistics Agent remits the collection to the Logistics Provider as per their mutual settlement terms;\n3. Logistics Provider settles with Buyer App (after deducting the amount for logistics services), as per their mutual settlement terms;\n4. Buyer App settles with Seller App after deducting the withholding amount, as per their mutual settlement terms;\n5. After the return window closes, Buyer App settles withholding amount with the Seller App (in case of no refund for return, damages, etc.);\nBuyer App\nNA\nNA\nDiscussed above\nNA\nNA\nSeller App\nNA\nDiscussed above\nDiscussed above (e.g. between retail seller app and logistics seller app)\nSeller Appsettleswith Seller as per their mutual terms & conditions\nNA\nSeller\nNA\nNA\nNA\nNA\nNA\nLogistics Agent\nNA\nDiscussed above\nDiscussed above\nNA\nNA\n3. Possible use of Refund Pool\nThe refund pool, maintained by the Buyer App or Seller App, using the withholding amount, could be used for quick settlement with the buyer, for the following:\nRefund in case of part or full return;\nRefund in case the buyer receives items (e.g. perfume) in a damaged or broken state[c];\n4. Commercial Components of Order\nThe commercial components of an order shall include the details below.All numbers shown below, for the components, are hypothetical and only for the purpose of illustration and nothing else.\nDeclared Price(per item) - this is the price declared by the seller-on-record or merchant and shown on the Buyer App catalog and may or may not be inclusive of GST;\nTotal Order Value-this is the final price, payable by a buyer and is computed by the seller, with the following components:\nDeclared Price: Price declared by the provider;\nConvenience Charge - Seller / Seller Marketplace may use this line to recover any costs or charges that it might like to recover from the buyer. Recovering buyer finder fee or seller app fee from the buyer by including it in convenience charge is at the discretion of the seller / seller app (see note below). Sellers may choose not to recover the buyer finder fee from the buyer in the convenience fee and absorb it like other costs;\nDelivery Charges:  Seller Marketplace may send delivery charges equal to or lower than or higher than the actual or quoted logistics cost;\nPackaging Charges: Charges that seller / seller marketplace may choose to recover;\nTaxes: GST on each of the above lines is expected to be included ineach of the quotes for the line[d]itself. For eg the item price of mobile phone of Rs.10,000 includes GST of Rs. 1,525. Only exception as of now is GST collected by ECO (ecommerce operator) in case of online food delivery and online cab bookings presently @ of 5% on the item price.\nTotal order value (Quote)=Σ(list price for items + service charges for logistics / packing / convenience fees + taxes) + buyer app fee (applied as % of AOV) which is the same as Σ(list price for items + buyer app fee as % of list price) + Σ(service charges + buyer app fee as % of service charges) + taxes applied to declared price for item + services;\nFinal Product consideration due to the seller-on-record is (list price for the seller - TCS if any);[e]\nScenario[f][g]\nList price of item = ₹100 (includes seller app fee if any, seller app calculations are off network under this calculation and therefore principle of double taxation is handled there)\nDelivery charges[1]= ₹50 (exclusive of taxes)\nBuyer finder fee (BFF)[2]= 5% of total order value (doesn’t include GST)\nGST for BFF = 18%\nGST for product = 5%\nGST for delivery charges = 5%\nHow BFF is applied?\nBuyer App sends search request with finder fee =5.9%(includes BFF+GST, i.e.5% + 18% of 5%)\nSeller app calculates & sends declared price for item =₹100 + 5.9% of ₹100 (BFF)\nDeclared price on catalog= ₹105.90\nIncludes BFF of ₹5 + GST on BFF of ₹0.90\nSeller app calculates & sends declared price for delivery charge =₹50 + 5.9% of ₹50\nDeclared price for delivery charge = ₹52.95\nIncludes BFF of ₹2.5 + GST on BFF of ₹0.45\nSeller app calculates tax on item & sends in quote = 5% of ₹100= ₹5\nSeller app calculates tax on delivery charge & sends in quote = 5% of ₹50= ₹2.5\nTotal order value =₹105.90 + ₹52.95 + ₹5 + ₹2.5 = ₹166.35\nBFF should be applied on₹100 + ₹50 = ₹150.0[h]\nPayment & Settlement (excluding TDS, TCS)\nBuyer pays -₹166.35\nBFF (including GST) = 5.9% of₹150.0 = ₹8.85\nSeller App receives =₹166.35 - ₹8.85 = ₹157.50\nSeller App pays LSP =₹52.5\nMerchant receives =₹157.50 - ₹52.5 = ₹105.0\nExceptions\nIf adding the BFF to the declared price for an item causes it to exceed the MRP, the BFF (for the item) can be sent as convenience charge as per the API contract;[i]\nBFF, of fixed amount, can be added to the item or delivery charges or split between these charges at the discretion of the seller app;\nSummary\nThe quote for an order will be the cumulative value of the Declared Price for individual items in the Order, price for logistics services and markup / discounts provided by the Buyer App;\nAdditional charges such as for logistics services (whether imposed  by Seller App or Buyer App), markups or discounts offered by Buyer App, etc. will be separate line items in the Order;\nThe cost for logistics services will be included in the quote for the Order, through the seller app or buyer app, based on how it was procured. In this case, the payment for logistics services will be initiated by the Seller App or Buyer App that procured such services;\nInvoice will be generated by the seller-on-record and made available to the buyer as part of the protocol;\n5. Terms & Conditions\nPayment & Settlement terms & conditions will be decided as part of the Order lifecycle. Some of these terms & conditions will be fixed by one or more parties to the transaction. Other terms & conditions will be mutually negotiated between the parties to the transaction.\nFixed terms & conditions\nTerms & ConditionsFixed byMandatory?Default valueDefinitionProtocol ReferenceBuyer AppFinder FeeBuyer App (as part of Search Intent)No0Finder fee for the Buyer App as a % of the total order value or a fixed amount per orderAPI/search;SchemaIntent.payment.”./ondc-buyer_app_finder_fee_type”Intent.payment.”./ondc-buyer_app_finder_fee_amount”Settlement Start TimeBased on type of paymentNoFor prepaid - timestamp of payment transaction reference; for CoD - timestamp of deliveryForprepaid, based on settlement basis  - collection (timestamp of payment transaction reference), shipment or delivery;Forcash-on-delivery, settlement start time is triggered on delivery.Schema- for:Collection - order.payment.time.timestampShipment -order.fulfillment.start.time.timestampDelivery -order.fulfilment.end.time.timestamp\nTerms & Conditions\nFixed by\nMandatory?\nDefault value\nDefinition\nProtocol Reference\nBuyer AppFinder Fee\nBuyer App (as part of Search Intent)\nNo\n0\nFinder fee for the Buyer App as a % of the total order value or a fixed amount per order\nAPI\n/search;\nSchema\nIntent.payment.”./ondc-buyer_app_finder_fee_type”\nIntent.payment.”./ondc-buyer_app_finder_fee_amount”\nSettlement Start Time\nBased on type of payment\nNo\nFor prepaid - timestamp of payment transaction reference; for CoD - timestamp of delivery\nForprepaid, based on settlement basis  - collection (timestamp of payment transaction reference), shipment or delivery;\nForcash-on-delivery, settlement start time is triggered on delivery.\nSchema- for:\nCollection - order.payment.time.timestamp\nShipment -\norder.fulfillment.start.time.timestamp\nDelivery -\norder.fulfilment.end.time.timestamp\nNegotiable terms & conditions\nTerms & conditions for payment & settlement, that will be mutually negotiated between the participants, as part of the transaction, include:\nTerms & ConditionsDefinitionMandatory?Default ValueWhen negotiatedProtocol ReferenceWho collects payment?Who collects the payment - buyer app, seller app (logistics agent always collects for cash on delivery)YesN/Aa. Search Intent (optional);b. Order Initialization (mandatory)a.API- /search;Schema- Intent.payment.collected_byb.API- /init, /on_init;Schema- Order.payment.collected_bySettlement Basis[j]In case of prepaid payment, whether settlementbetween[k]counterparties should be on the basis of collection, shipment or deliveryNoCollection basisSchema-order.payment.”./ondc-settlement_basis”Withholding Amount% of cumulative declared price (by the entity that collects payment)No0Order InitializationAPI- /init, /on_init;Schema-order.payment.”./ondc-withholding_amount”Return Window[l][m]Number of calendar days from order delivery, after which withholding amount will have to be settled, in case of no returnsNoN/AOrder InitializationAPI- /init, /on_init;Schema- order.payment.”./ondc-return_window”Settlement WindowNumber of calendar days from settlement start time, within which settlement with counterparty has to be completedYesN/AOrder InitializationAPI- /init, /on_init;Schema-order.payment.”./ondc-settlement_window”\nTerms & Conditions\nDefinition\nMandatory?\nDefault Value\nWhen negotiated\nProtocol Reference\nWho collects payment?\nWho collects the payment - buyer app, seller app (logistics agent always collects for cash on delivery)\nYes\nN/A\na. Search Intent (optional);\nb. Order Initialization (mandatory)\na.API- /search;\nSchema- Intent.payment.collected_by\nb.API- /init, /on_init;\nSchema- Order.payment.collected_by\nSettlement Basis[j]\nIn case of prepaid payment, whether settlementbetween[k]counterparties should be on the basis of collection, shipment or delivery\nNo\nCollection basis\nSchema-\norder.payment.”./ondc-settlement_basis”\nWithholding Amount\n% of cumulative declared price (by the entity that collects payment)\nNo\n0\nOrder Initialization\nAPI- /init, /on_init;\nSchema-order.payment.”./ondc-withholding_amount”\nReturn Window[l][m]\nNumber of calendar days from order delivery, after which withholding amount will have to be settled, in case of no returns\nNo\nN/A\nOrder Initialization\nAPI- /init, /on_init;\nSchema- order.payment.”./ondc-return_window”\nSettlement Window\nNumber of calendar days from settlement start time, within which settlement with counterparty has to be completed\nYes\nN/A\nOrder Initialization\nAPI- /init, /on_init;\nSchema-\norder.payment.”./ondc-settlement_window”\n6. Payment & Settlement Process Flow\nThis section elaborates the process flows for Payment & Settlement, for an order, along with appropriate examples, for different scenarios, in ONDC:\nScenario 1 - Buyer App collect payments, Seller App agrees\nThe process flow for payment & settlement will be as follows for a Buyer App and a single Seller App. In case of multiple Seller Apps, the same process will be repeated for each Seller App.\nBuyer App asserts the right tocollect paymentfor the Order. Buyer App asserts this right, by also specifying thewithholding amountas a % of cumulative declared price,settlement basis,settlement windowandreturn window;\nSeller App agrees to Buyer App asserting to collect payment.\nSeller App & Buyer App can mutually negotiate on the other terms & conditions (withholding amount, settlement basis, settlement window, return window[n][o])and come to an agreement. When there is agreement, Seller App specifies its settlement mechanism;\nBuyer App collects payment from Buyer and settles with Seller App as per its settlement terms & conditions, after deducting the withholding amount. In case logistics services were procured through the Buyer App, the Buyer App also settles with the logistics provider, based on its settlement terms & conditions;\nIn case logistics services were procured through the Seller App, the Seller App settles with the logistics provider based on its settlement terms & conditions;\nAfter thereturn windowcloses, Buyer App transfers the withholding amount to Seller App as per its settlement terms & conditions in case of no returns (settlement window will be applied from the day after closure of return window);\nFigure 2\nProcess Flow: Payment Collection by Buyer App\nExample\nBuyer purchases 10 kg of Atta through a Buyer App and declared price for this item by a Seller App is ₹630. Buyer App has a fixed finder fee of 5%, included in the declared price. Seller App also provides free delivery through logistics provider;\nDuring confirmation of order, buyer app & seller app negotiate the payment & settlement terms & conditions as follows (assume settlement start time is 21st Mar 2022):\nBuyer App & Seller App mutually negotiate and agree on the following -withholding amountof 10%,settlement windowof 2 days,return windowof 7 days;\nSeller App provides itssettlement details(payee bank account no);\nBuyer App collects ₹630 from buyer;\nBuyer App deductswithholding amountof ₹63, itsfinder feeof ₹31.5[p]and pays Seller App ₹535.5 by 23rd Mar 2022;\nBuyer App transfers withholding amount of ₹63 to Seller App by 30th Mar 2022 (on closure of return window on 28th Mar, assuming no returns);\nScenario 2 - Seller App collects payment\nThe process flow for payment & settlement will be as follows for a Buyer App and a single Seller App. In case of multiple Seller Apps, the same process will be repeated for each Seller App.\nBuyer App refuses to assert first right to collect payment and Seller App agrees to collect payment;\nSeller App & Buyer App mutually negotiate & agree on the following -withholding amountof 10%,settlement windowof 2 days,return windowof 7 days.\nBuyer App provides its settlement details (payee bank account no);\nSeller App collects payment from Buyer and settles with Buyer App, itsFinder Fee, as per the mutually agreed settlement terms & conditions.In case logistics services were procured through the Buyer App, the Seller App also includes the cost of logistics services;\nIn case logistics services were procured through the Seller App, the Seller App settles with the logistics provider based on its settlement terms & conditions;\nFigure 3\nProcess Flow: Payment Collection by Seller App\nExample\nBuyer purchases 5 kg of Atta through a Buyer App and declared value for this item by a Seller App is ₹315. Buyer App has a fixed finder fee of 5%, included in the declared price. Seller App also provides home delivery through a logistics provider which charges fees of ₹30. Hence, total order value is ₹315 + ₹30 = ₹345;\nDuring confirmation of order, buyer app & seller app negotiate the payment & settlement terms & conditions as follows (assume settlement start time is 21st Mar 2022):\nBuyer App refuses to assert right to collect payment and Seller App agrees to collect payment;\nSeller App & Buyer App mutually negotiate & agree on the following -settlement windowof 2 days;\nBuyer App provides its settlement details (payee bank account no);\nSeller App collects ₹345 from buyer;\nSeller App pays Buyer App ₹15 (Finder fee) by 23rd Mar 2022;\nSeller App pays Logistics Provider ₹30 as per their settlement terms & conditions;\nSettlement of withholding amount will be between the Seller App and the Seller;\nCash on delivery payment\nCash on delivery payment can happen only when there is a match between the payment modes offered by the buyer and the modes of collection by the Logistics Agent, e.g. buyer offers payment in Cash or UPI and Logistics Agent accepts these modes of payment collection. In this case, the cash on delivery payment will happen and the order fulfilment is completed.\nIn case there is a mismatch in the payment modes offered by the buyer and the modes of collection by the Logistics Agent,e.g. buyer offers payment in credit card and Logistics Agent accepts cash or UPI only, it will be up to the Logistics Provider[q][r][s][t]to decide whether to cancel the order and perform a return to origin (RTO).\nThe process flow for payment & settlement will be as follows for a Buyer App, a single Seller App and a single Logistics Provider. In case of multiple Seller Apps, it is assumed the order will be fulfilled by the same or different logistics providers, but the order through a Seller App will be fulfilled by a single logistics provider. Hence, in the case of multiple Seller Apps with a single or multiple logistics providers, the same process will be repeated for each Logistics Provider.\nAs part of the order confirmation process, Buyer App and Seller App will mutually negotiate and agree to the following terms & conditions -withholding amount&return window(in case logistics services procured by Buyer App),settlement window. Additionally, the logistics provider would have negotiated their settlement terms & conditions with the Seller App or Buyer App, through which their services was procured;\nLogistics Agent collects payment from Buyer and settles with Logistics Provider (as per their terms & conditions). Settlement start time, with Seller App and Buyer App, is from the delivery of order;\nIf logistics services were procured through the Seller App:\nLogistics Provider settles with Seller App, after deducting their charges from the collected amount, as per their settlement terms & conditions;\nSeller App settles with the Buyer App as per its settlement terms & conditions (i.e.Finder fee);\nIf logistics services were procured through the Buyer App:\nLogistics Provider settles with Buyer App, after deducting their charges from the collected amount, as per their settlement terms & conditions;\nBuyer App settles with the Seller App as per its settlement terms & conditions, after deducting itsFinder feeandwithholding amount;\nAfter thereturn windowcloses, Buyer App transfers thewithholding amountto Seller App as per its settlement terms & conditions (settlement window will be applied from the day after closure of return window);\nFigure 4\nProcess Flow: Cash on Delivery Payment\nExample\nBuyer purchases 5 kg of Atta through a Buyer App and declared value for this item by a Seller App is ₹420. Buyer App has a fixed finder fee of 5%, included in the declared price. Seller App also provides home delivery through a logistics provider which charges fees of ₹30. Hence, total order value is ₹420 + ₹30 = ₹450;\nDuring confirmation of order, buyer app & seller app negotiate the payment & settlement terms & conditions as follows (assume settlement start time starts on 21st Mar 2022):\nBuyer App & Seller App mutually negotiate and agree on the following -settlement windowof 3 days;\nBuyer App provides its settlement details (payee bank account no);\nSeller App agrees to settlement window of 1 day with Logistics Provider and specifies its payee account details;\nLogistics Agent collects ₹450 from buyer and settles with their Logistics Provider;\nLogistics Provider pays Seller App ₹420(after deducting their charges of ₹30) by 22nd Mar;\nSeller App pays Buyer App its Finder fee of ₹20 by 24th Mar;\nSettlement of Withholding Amount will be between the Seller App and the Seller;\nRefunds\nRefunds in cases of returns, cancellations,damaged[u][v][w]items, etc. will be as follows:\ni.Cancellation- refund will be initiated as follows:\nPrepaid order -[x]by the entity that collected the payment from the buyer (i.e. buyer app or seller app) and the refund money flow will be the exact reverse of the payment money flow;\nCoD order - since cancellation happens before delivery, no payment would be made and hence, there is no refund;\nii.Return- refund will be initiated as follows:\nPrepaid order - by the entity that collected the payment from the buyer (and has the withholding amount) and the refund money flow will be the exact reverse of the payment money flow;\nCoD order - by the entity that has the withholding amount (i.e. Seller App or Buyer App), and will be the same as the entity that procured the services of the Logistics Provider. If the Seller App initiates the refund,it will transfer the amount to the Buyer App[y]and therefund will be in the form of credit to the buyer account. If the Buyer App initiates the refund, it willcredit the buyer account;\niii.Damaged Items- refund money flow will be the same as Return.\n7. Technical details for Payment and Settlement\nPayment & Settlement terms will be communicated using the Payment object. This section shows thePaymentobject at different steps for each of the process flows presented earlier. Each of these scenarios only shows the parameters relevant to that specific scenario.All values shown in the scenarios below are hypothetical and only for the purpose of illustration and nothing else.\nBuyer App Finder fee - fixed\n/search:providing its finder fee as part of the search intent. This could be expressed as a fixed amount or a % of the total order value:\n{\n“./ondc-buyer_app_finder_fee_type”: “amount”,\n“./ondc-buyer_app_finder_fee_amount”: “50”\n}\nOR\n{\n“./ondc-buyer_app_finder_fee_type”: “percent”,\n“./ondc-buyer_app_finder_fee_amount”: “5”\n}\nWho collects payment - negotiable\nThis scenario shows a single negotiable variable - “Who collects payment?”. Note that multiple variables can be negotiated simultaneously.\n/init: Buyer App asserts its right to collect payment:\n{\n“collected_by”: “BAP”,\n“./ondc-collected_by_status”: “Assert”\n}\n/on_init: Seller App agrees:\n{\n“collected_by”: “BAP”,\n“./ondc-collected_by_status”: “Agree”\n}\n/on_init: If Seller App disagrees:\n{\n“collected_by”: “BAP”,\n“./ondc-collected_by_status”: “Disagree”\n}\n/init: If Buyer App wishes to withdraw its assertion:\n{\n“collected_by”: “”,\n“./ondc-collected_by_status”: “”\n}\n/on_init:If Seller App asserts its right to collect payment (note: the Buyer App should agree to this in the subsequent /init call):\n{\n“collected_by”: “BPP”,\n“./ondc-collected_by_status”: “Assert”\n}\n/init: If Buyer App wishes to terminate the negotiation as it can’t reach an agreement with Seller App:\n{\n“collected_by”: “BAP”,\n“./ondc-collected_by_status”: “Terminate”\n}\n/on_init: If Seller App wishes to terminate the negotiation as it can’t reach an agreement with Buyer App:\n{\n“collected_by”: “BAP”,\n“./ondc-collected_by_status”: “Terminate”\n}\nBuyer App collects payment (prepaid) and provides proof of payment\n/confirm:\n{\n“collected_by”: “BAP”,\n“type”: “ON-ORDER”,\n“status”: “PAID”,\n“params”: {\n“transaction_id”: “payment transaction id for pre-paid payment to buyer app”,\n“amount”: “1000”,\n“currency”: “INR”\n}\n“time”: {\n“timestamp”: “2022-03-21 00:00:00”\n}\n}\nSeller App provides UPI payment link for prepaid payment\nSeller App provides UPI payment link, for rendering, by Buyer App:\n/on_init:\n{\n“collected_by”: “BPP”,\n“uri”: “upi://pay?pa=UPIID@oksbi&amp;pn=NAME&amp;&tr=123456789&amp;cu=INR&amp;am=1000”,\n“tl_method”: “upi”,\n“type”: “ON-ORDER”,\n“status”: “NOT-PAID”,\n“params”: {\n“amount”: “1000”,\n“currency”: “INR”\n}\n}\nSeller App provides proof of payment\n/on_status:[z]\n{\n“collected_by”: “BPP”,\n“uri”: “upi://pay?pa=UPIID@oksbi&amp;pn=NAME&amp;&tr=123456789&amp;cu=INR&amp;am=1000”,\n“tl_method”: “upi”,\n“type”: “ON-ORDER”,\n“status”: “PAID”,\n“params”: {\n“transaction_id”: “payment transaction id for pre-paid payment to seller app”,\n“amount”: “1000”,\n“currency”: “INR”\n}\n“time”: {\n“timestamp”: “2022-03-21 00:00:00”\n}\n}\nSeller App provides payment gateway link for prepaid payment\nSeller App provides payment gateway link, for rendering, by Buyer App:\n/on_init:\n{\n“collected_by”: “BPP”,\n“uri”: “https://pay.example.com?transaction_id=$transaction_id&amount=$amount&cur=$currency”,\n“tl_method”: “http/post”,\n“type”: “ON-ORDER”,\n“status”: “NOT-PAID”,\n“params”: {\n“transaction_id”: “transaction identifier”,\n“amount”: “1000”,\n“currency”: “INR”\n}\n}\nSeller App provides proof of payment\n/on_status:\n{\n“collected_by”: “BPP”,\n“uri”: “https://pay.example.com?transaction_id=$transaction_id&amount=$amount&cur=$currency”,\n“tl_method”: “http/post”,\n“type”: “ON-ORDER”,\n“status”: “PAID”,\n“params”: {\n“transaction_id”: “transaction identifier”,\n“amount”: “1000”,\n“currency”: “INR”\n}\n“time”: {\n“timestamp”: “2022-03-21 00:00:00”\n}\n}\nCash on Delivery payment\nBuyer App decides onCoDpayment:\n/init:\n{\n“type”: “POST-FULFILLMENT[aa][ab]”,\n“status”: “NOT-PAID”,\n“params”: {\n“amount”: “1000”,\n“currency”: “INR”,\n}\n}\nBuyer App collects payment, Seller App provides settlement details[3]\n/on_init:\n{\n“collected_by”: “BAP”,\n“./ondc-settlement_details”: {\n“settlement_counterparty”: “seller-app”,\n“settlement_type”: “neft”,\n“settlement_bank_account_no”: “bank account no”,\n“settlement_ifsc_code”: “IFSC code”,\n}\n}\nSeller App collects payment, Buyer App provides settlement details\n/init:\n{\n“collected_by”: “BPP”,\n“./ondc-settlement_details”: {\n“settlement_counterparty”: “buyer-app”,\n“settlement_type”: “neft”,\n“settlement_bank_account_no”: “bank account no”,\n“settlement_ifsc_code”: “IFSC code”,\n}\n}\nBuyer App settles, updates settlement details\n/update(message.update_target = “billing[ac]”):\n{\n“./ondc-settlement_details”: {\n“settlement_counterparty”: “seller-app”,\n“settlement_phase”: “sale-amount”,\n“settlement_reference”: “transaction reference no”,\n“settlement_status”: “PAID”,\n“settlement_timestamp”: “2022-03-31 00:00:00”\n}\n}\nSeller App settles, updates settlement details\n/on_update(message.update_target = “billing”):\n{\n“./ondc-settlement_details”: {\n“settlement_counterparty”: “buyer-app”,\n“settlement_phase”: “sale-amount”,\n“settlement_reference”: “transaction reference no”,\n“settlement_status”: “PAID”,\n“settlement_timestamp”: “2022-03-31 00:00:00”\n}\n}\nBuyer App checks settlement status\n/status\nSeller App generates invoice[4]for seller-on-record\n/on_confirm- use Order.billing (for billing information including GST no), Order.documents (label = “Invoice”, url = invoice URL);\n[1]Same logic applies for other non-item, non-tax charges such as packing, misc, etc.\n[2]Buyer app invoice for BFF will have breakup for BFF (without GST), GST\n[3]Settlement bank account no will most probably be encrypted\n[4]Invoicing models availablehere\n[a]Hi @supriyo@ondc.org\nHow to manage the scenario when we do not want to be involved in the any  kind of transaction, we just want  that Buyer pays to seller and we get from the seller.\n_Assigned to supriyo@ondc.org_\n[b]Please give me access to this docs or public this docs.\n[c]How this will be communicated in the protocol about defective items?\nDoes here buyer does partial return of the defective item or some other flow?\n[d]@nitin@ondc.org @abhishek.singh@ondc.org\ndeclared price of each item\n[e]This is also incorrect - would refrain from having this here as this is between Seller NP & Seller on Record. My understanding is that RSP ends at payout to Seller NP.\n[f]@ankit@nirmitbharat.org @manik@nirmitbharat.org - pls check this example of how BFF is applied;\ncc @rahul@nirmitbharat.org\n[g]noted\n[h]This is incorrect .. As per commercial policy, Buyer APP may charge BFF on the Total Order Value i.e. amount payable by the buyer excluding any promo or discount from the buyer app\n[i]But the BFF is subtracted from the convenience charge as well at the buyer app end. so this is not going to help the seller either @abhishek passi\n[j]in which API is this negotiated and what are the different stages of negotiation?\n[k]Possibility of settlement basis can be in multiple combinations of collection, shipment or delivery. Scenario proposed could be 10% on confirm, 40% on delivery & 50% on return window closure. Therefore, we need to extend the tags with following. Please consider:\n\"@ondc/org/payment_on_collection_type_status\": \"Assert\",\n\"@ondc/org/payment_on_collection_type\": \"Percent\",\n\"@ondc/org/payment_on_collection_value\": \"string\",\n\"@ondc/org/payment_on_shipment_status\": \"Assert\",\n\"@ondc/org/payment_on_shipment_type\": \"Percent\",\n\"@ondc/org/payment_on_shipment_value\": \"string\",\n\"@ondc/org/payment_on_delivery_status\": \"Assert\",\n\"@ondc/org/payment_on_delivery_type\": \"Percent\",\n\"@ondc/org/payment_on_delivery_value\": \"string\",\n[l]@ONDC: Return Window is defined for the individual items in the /on_search response by the seller NP (param: @ondc/org/return_window).\nHow can this parameter be negotiable in /init, /on_init at the participants level?\n[m]this is actually the return window for withholding amount; currently, it's at the order level\n[n]Is the number of attempts by logistics provider and differential pricing (say first 2 attempts included in delivery fee) possible? How is rescheduling of order based on customer availability handled? These impact the parameters of settlement and returns\n[o]we plan to handle this thru fulfillment options to be selected by buyer\n[p]@supriyo@ondc.org In the 1st para of the example, it is written that 5% BFF is included in the declared price, does it not makes the finder fee to be 0.05*630/1.05 = 30 Rs., withholding amount to be 60 Rs. and payment to seller app be 540?\n_Assigned to supriyo@ondc.org_\n[q]Wouldn't it be optimal to let the buyer decide at the time of delivery and logistics provider accept the mode available during the time and reconcile later? RTO / cancel will result into poor customer experience\n[r]agree but how do we it? Typically, some LSPs accept COD, hence we're passing it as parameter in logistics /search\n[s]Actually, the buyer would select his payment method upon checkout...so if a buyer pays via CC, the order wouldn't get routed to a LSP that only accepts cash or UPI, correct?\n[t]No. LSP is decided based on the type (prepaid, cod) selected by buyer at checkout. Some LSPs collect cash, others don't; hence, this info is made available to them during search\n[u]Damages could happen at seller packing, during transport and before / after delivery. How is the Quality check baked in the protocol to agree to the ownership of the damage and settlement process therein?\n[v]we're working on a codified SOP for pickup & delivery that will take care of this. @megha.bansal@ondc.org  - for your comments\n[w]We will make the QC SOP with Ownership and responsibility attributed in different scenarios\n[x]How about giving an option to keep the credit in the buyer account instead of crediting ?\nI ncase of multiple products - what if there are promotions based on the item (product) which is being returned v/s item which are being retained by buyer?\n[y]typo? transfer amount to buyer or buyer app?\n[z]this will be unsolicited call - happen when seller receives payment?\nWhat is payment is received before order confirmation?\n[aa]this is a payment param and will be changed to on-fulfillment\n[ab]Also, add settlement trail for COD, COD being overridden by other option, refund money trail details\n[ac]Should this be payment?",
  "footer_content": "",
  "enums": {
    "i.e. amount payable by the buyer excluding any promo or discount from the buyer app\n[i]But the BFF is subtracted from the convenience charge as well at the buyer app end. so this is not going to help the seller either @abhishek passi\n[j]in which API is this negotiated and what are the different stages of negotiation?": [
      "k"
    ],
    "to be selected by buyer\n[p]@supriyo@ondc.org In the 1st para of the example, it is written that 5% BFF is included in the declared price, does it not makes the finder fee to be 0.05*630/1.05 = 30 Rs., withholding amount to be 60 Rs. and payment to seller app be 540?\n_Assigned to supriyo@ondc.org_\n[q]Wouldn't it be optimal to let the buyer decide at the time of delivery and logistics provider accept the mode available during the time and reconcile later? RTO / cancel will result into poor customer experience\n[r]agree but how do we it? Typically, some LSPs accept COD, hence we're passing it as parameter in logistics /search\n[s]Actually, the buyer would select his payment method upon checkout...so if a buyer pays via CC, the order wouldn't get routed to a LSP that only accepts cash or UPI, correct?\n[t]No. LSP is decided based on the type (prepaid, cod) selected by buyer at checkout. Some LSPs collect cash, others don't; hence, this info is made available to them during search\n[u]Damages could happen at seller packing, during transport and before / after delivery. How is the Quality check baked in the protocol to agree to the ownership of the damage and settlement process therein?\n[v]we're working on a codified SOP for pickup & delivery that will take care of this. @megha.bansal@ondc.org  - for your comments\n[w]We will make the QC SOP with Ownership and responsibility attributed in different scenarios\n[x]How about giving an option to keep the credit in the buyer account instead of crediting ?\nI ncase of multiple products - what if there are promotions based on the item (product) which is being returned v/s item which are being retained by buyer?\n[y]typo? transfer amount to buyer or buyer app?\n[z]this will be unsolicited call - happen when seller receives payment?\nWhat is payment is received before order confirmation?\n[aa]this is a payment param and will be changed to on-fulfillment\n[ab]Also, add settlement trail for COD, COD being overridden by other option, refund money trail details": [
      "ac"
    ],
    "ONDC": [
      "a"
    ],
    "on_status": [
      "z"
    ]
  },
  "definitions": {
    "consider": "@ondc/org/payment_on_collection_type_status",
    "of": "buyer app finder fee as % of total order value or fixed amount per order;",
    "Protocol": "Reference"
  },
  "hyperlinks": [
    {
      "text": "negotiation",
      "url": "https://www.google.com/url?q=https://docs.google.com/document/d/1H1ZOwpcUkjrKNyeVKJjwqkxCXFEri0C84JkqOsR5CAI/edit&sa=D&source=editors&ust=1751977142470295&usg=AOvVaw1twyX-G-wbiOurh05Tp3hT",
      "context": "negotiation"
    },
    {
      "text": "protocol",
      "url": "https://www.google.com/url?q=https://docs.google.com/document/d/1H1ZOwpcUkjrKNyeVKJjwqkxCXFEri0C84JkqOsR5CAI/edit&sa=D&source=editors&ust=1751977142470787&usg=AOvVaw3Ue60TjPEzIZAX1Pf6kzke",
      "context": "protocol"
    },
    {
      "text": "here",
      "url": "https://www.google.com/url?q=https://docs.google.com/presentation/d/1rVb9XHsxG5aCp0Vsl9IsJ-lo4xAnXTBg/edit%23slide%3Did.p1&sa=D&source=editors&ust=1751977142652362&usg=AOvVaw1yIZq4inshaAyvTs_TAVTN",
      "context": "here"
    }
  ],
  "version": "unknown",
  "source_url": "https://www.google.com/url?q=https://docs.google.com/document/d/1iqLdayk488ekEzKrEs-yn6gVrevbxBkILBe5j4oIxMY/edit&sa=D&source=editors&ust=1751977097013658&usg=AOvVaw0wwI_jqMNbD8TYvLctDWjV"
}