{
  "doc_id": "1hKImxDwZ-LUd1ln0D61KhhuQ9-Rqrzt2",
  "title": "Referenceterms of the transaction level contract",
  "main_content": "Referenceterms of the transaction level contract\nVersion History\nVersionDateDescription / Changes0.12023-05-08First Draft\nVersion\nDate\nDescription / Changes\n0.1\n2023-05-08\nFirst Draft\nAll terms used herein, unless the context otherwise requires or unless specifically defined herein, shall have the meanings ascribed to them in the ONDC Network Policy or ONDC Network Participant Agreement, as the case may be.\nRepresentations and warranties:Each Party represents and warrants to the other Party that:\nthey have read, understood and agree to comply with the terms specified in this document along with the terms mutually agreed upon through the ONDC Protocol, and the same shall form a legal, valid and binding contract (“Agreement”) between the Parties with respect to this transaction;\nthis Agreement shall be construed in accordance with the provisions of the ONDC Network Participant Agreement and ONDC Network Policy or any other policies as prescribed by ONDC and the Applicable Law;\nit is duly organised and validly existing under the laws of India and has the full requisite right, power, and authority (corporate or otherwise) to enter into this Agreement and to deliver or perform the acts required of it under this Agreement;\nit has and shall maintain all necessary statutory and regulatory permissions, approvals, licences, consents or permits, from any third parties including any regulatory or government body as required by applicable law or regulations, that is necessary for the running and operation of its establishment for the conduct of its operations;\nit has and shall maintain all the title and ownership, licence, or right to use, as applicable, in all the IPR associated with it and there is no need for any payment or permission, or authorization required from any other party or entity to use, distribute, or otherwise exploit in all manners permitted by this Agreement and/or the ONDC Network Policy;\nall information submitted by the Parties is truthful, lawful and accurate, as on the date of this Agreement;\nit has complied with or will ensure compliance with all conditions provided under the Applicable Laws in order to enable it to lawfully enter into and exercise its rights and perform its obligations under this Agreement;\nthe fulfilment or compliance with the terms and provisions hereof, will not conflict with, or result in a breach of the provisions of any agreement, instrument, order, judgement, decree, statute, law, rule, or regulation to which they are subject to or the IPRs of any third party, or require any consent, approval or other action by any court, tribunal, administrative or Competent Authority, or result in a violation of any law, regulation, administrative order or judicial order applicable to it or its business or assets;\nit shall not make any statement to defame or disparage the other Party or adversely affect the other Party’s reputation, except when such statement is truthful and is reasonably necessary for the Party to enforce or defend its rights under this Agreement, or is required by a court of law, mediator, arbitrator or regulatory or legislative body with jurisdiction to order the Party to make such statement;\nit shall comply with the ONDC Network Agreement and ONDC Network Policy or any other policies as prescribed by ONDC; and\nall services will be performed in a professional manner consistent with the industry standards reasonably applicable to such services.\nIndemnity and Limitation of Liability\nEither Party (“Indemnifying Party”) hereby agrees to indemnify, defend and hold the other Party, its director, officers, employees, service providers, and agents (“Indemnified Party”) harmless from and against claims, demands, actions, liabilities, costs, interest, injuries, losses, judgments, fines penalties, proceedings, action or demand, damages, and expenses of any nature whatsoever (including all legal and other costs, charges and expenses) incurred or suffered by the Indemnified Party, arising out ofor in connection with any or all of the following:\nany wrongful or negligent act or omission of the Indemnifying Party, including but not limited to, sharing incorrect or incomplete information with the Indemnified Party in connection with a transaction on the ONDC Network;\nany breach by Indemnifying Party of its obligations, undertakings, warranties or covenants under this Agreement or the ONDC Network Policy or the ONDC Network Participant Agreement;\nany breach of Applicable Law by the Indemnifying Party;\nBreach of data or corruption of data or information whether due to any system failure or negligent performance or non-performance of the other Party or its employees, agents, representatives etc. or for any reason whatsoever attributable to that Party; and\nany third party action or claim made against the Indemnified Party, by reason of any actions undertaken/omission to take any action by the Indemnifying Party under this Agreement.\nEach Party shall be liable for any loss or damage caused to shipments that are attributable to any acts of commission or omission of such Party or its employees, agents, assigns, or other representatives to the extent of the value of the goods or services involved or as mutually decided through the ONDC Protocol.\nNotwithstanding Clause 3.1 and 3.2. above, each Party shall independently be liable for the services offered by it to the End Users, Buyers and other Network Participants, as per the relevant terms and conditions of each Party.\nPerformance Exceptions\nForce Majeure:If any Party to this Agreement is unable to meet its obligations under this Agreement as a result of flood, earthquake, storm, other acts of God including fire, derailment, accident, strike, lockout, explosion, war, insurrection, riot, embargo, terrorist activity, epidemic, pandemic, act of government or governmental agency or other similar cause beyond the reasonable control (\"Force Majeure\") of the parties, such party will be excused from performing its obligations for the duration of the Force Majeure.\nBoth parties shall adopt reasonable security measures commensurate with the industry standards and as mandated by Applicable Law, however, both Parties' application, services and/or services/applications of third-party service providers may not be fully uninterrupted or error free or free from any virus or other malicious, destructive or corrupting code/program. Neither Party shall be responsible or liable for any loss or damage (including loss of revenue, income, or profits), caused to the other Party, on account of any interruption or issues which are not in control of the Party.\nIf either Party is unable to meet its obligations under this Agreement as a result of a disruption in the ONDC Network, such party will be excused from performing its obligations for the duration of the disruption\nGoverning Law\nEach Party agrees that any dispute or claim relating to, the enforceability of, or the termination of this agreement is to be governed by and construed inaccordance with the laws of India.\nCategory Specific Clauses\nRetail F&B, Grocery, Consumer Electronics, Fashion, Home Decor, Beauty and Personal Care\nThe clauses under Section 6.1 will only apply if theinstant transactionis for the sale/purchase of goods belonging to the F&B, Grocery, Consumer Electronics, Fashion, Home Decor and Beauty & Cosmetics categories.\nFulfilment and Post Fulfilment\nThe Party responsible for procuring logistics must share Proof Of Delivery to the other Party, upon request from the other Party, provided that the request is made within 60 days after the expiry of the Maximum Delivery Period;\nFor the purposes of this clause, Maximum Delivery Period shall mean the sum of the period for delivery, as specified by the Party responsible for delivery, and 30 minutes or 50% of the promised delivery period, whichever is lower.\nBoth Parties agree that the Party responsible for the forward logistics will bear the cost of forward logistics and the Party responsible for reverse logistics will bear the cost of reverse logistics, in the event the Buyer returns any items, that are part of the Order; and\nOther terms of fulfilment and post fulfilment, will be as mutually agreed by the Parties through the ONDC Protocol.\nCancellations\nBoth parties agree that, if the Buyer does not accept delivery or cancels the order after it has been shipped the costs to be borne by each Party will be determined as per the cancellation terms mutually decided through the ONDC Protocol.\nHyperlocal Logistics\nThe clauses under Section 6.2 will only apply if theinstanttransaction is for the sale of hyperlocal logistics services by one Network Participant (Logistics Service Provider) to another Network Participant (Logistics Buyer) throughthe ONDC Network, and in relation to a transaction between a Buyer and Seller through the ONDC Network facilitated by the Logistics Buyer.\nFailed RTO:The Logistics Buyermay charge the Logistics Service Providerfor the cost of forward shipping, the cost of reverse shipping, if applicable, and cost of product, in the event theLogisticsService Provider is unable to complete Return to Origin.\nProof of Delivery:Logistics Service Provider agrees to share Proof of Delivery for the Order with the Logistics Buyer, whenever requested by the Logistics Buyer, for up to 60 days from the date of order confirmed to the Buyer.\nCOD Remittance:The Logistics Service Provider agrees to remit the cash collected on a Cash on Delivery Order within a maximum of 2 days to the Logistics Buyer.\nCancellation:Both Parties agree that in case the Buyer cancels an Order because of delay in delivery:\nif the delay is attributable to late shipment by the Seller, the Logistics Buyer will bear the cost of cancellation subject to the limitation of liability as mutually agreed through the ONDC Protocol, and\nif the product is shipped on time, and the delay is attributable to the Logistics Service Provider, the Logistics Service Provider will bear the cost of cancellation subject to the limitation of liability as mutually agreed through the ONDC Protocol, subject to limitation of liability as mutually agreed through the ONDC Protocol.\nOther contractual terms: The Parties agree to the otherterms asmutuallyagreed through the ONDC Protocol.\nInter-city logistics\nThe clauses under Section 6.3 will only be applicable to all individual inter-city logistics transactions on the ONDC Network.\nFailed RTO:The Logistics Buyermay charge the Logistics Service Providerfor the cost of forward shipping, the cost of reverse shipping, if applicable, and cost of product, in the event theLogisticsService Provider is unable to complete Return to Origin.\nProof of Delivery:Logistics Service Provider agrees to share Proof of Delivery for the Order with the Logistics Buyer, whenever requested by the Logistics Buyer, for up to 60 days from the date of order confirmed to the Buyer.\nCOD Remittance:The Logistics Service Provider agrees to remit the cash collected on a Cash on Delivery Order within a maximum of 2 days to the Logistics Buyer.\nCancellation:Both Parties agree that in case the Buyer cancels an Order because of delay in delivery:\nif the delay is attributable to late shipment by the Seller or Logistics Buyer, the Logistics Buyer will bear the cost of cancellation subject to the limitation of liability as mutually agreed through the ONDC Protocol, and\nIf the consignment is shipped on time, and the delay is attributable to the Logistics Service Provider, the Logistics Service Provider will bear the cost of cancellation subject to the limitation of liability as mutually agreed through the ONDC Protocol.\nWeight disputes:\nIn case of a mismatch between the weight of consignment as gauged by the Logistics Service Provider and the weight reported by the Logistics Buyer:\nif the weight of the consignment as per the Logistics Service Provider is more than what the Logistics Buyer specified at the time of placing the logistics order,the Logistics Service Provider reserves the right to charge the Logistics Buyer for any such additional weight, as the case may be; and\nif the weight of the consignment as per the Logistics Service Provider is less than what the Logistics Buyer Specified at the time of placing the logistics order, the Logistics Service Provider reserves the right to provide a discount to the Logistics Buyer for the difference.\nWithout regard to any mismatch in the weight of a consignment, as specified in Clause 6.3.6.1,the Logistics Buyerwill duly pay to the Logistics Service Provider the charges/costs, originally agreed upon through the ONDC Protocol.\nTo recover any additional charges under Clause 6.3.6.1.1, the Logistics Service Provider reserves the right to file an issue through ONDC’s issue and grievance management framework.\nTo receive a reimbursement for a discount under Clause 6.3.6.1.2, if any, the Logistics Buyer reserves the right to file an issue through ONDC’s issue and grievance management framework.\nOther contractual terms: The Parties agree to the other terms as mutually agreed through the ONDC Protocol.",
  "footer_content": "",
  "enums": {},
  "definitions": {
    "shall": "the sum of the period for delivery, as specified by the Party responsible for delivery, and 30 minutes or 50% of the promised delivery period, whichever is lower."
  },
  "hyperlinks": [],
  "version": "6.3.6",
  "source_url": "https://www.google.com/url?q=https://docs.google.com/document/d/1hKImxDwZ-LUd1ln0D61KhhuQ9-Rqrzt2/edit%23heading%3Dh.9z4gdnelcvjh&sa=D&source=editors&ust=1751977097003474&usg=AOvVaw3rZZvCg2kVIf-aNXte0rv7"
}